[
  {
    "page": 1,
    "text": "2030Transformation MORGAN LEADING THE FUTURE STRA TEGIC GOALS 2021–2030"
  },
  {
    "page": 2,
    "text": "2030Transformation MORGAN LEADING THE FUTURE T able of Contents 3 Institutional Profile 4 A Message From the President 6 Vision Statement 7 Our Mission 8 Our Core Values 12 Strategic Planning at Morgan State University 19 Strategic Goals, 2021–2030 23 Strategic Priorities and Benchmarks 2021–2030 36 Enterprise Planning at Morgan State University: The Road Ahead 2030Transformation MORGAN 2"
  },
  {
    "page": 3,
    "text": "FFounded in 1867, Morgan State University, is a Carnegie-classified, doctoral, high-research institution providing instruction to a multiethnic, multiracial, multinational student body and offering nearly 140 academic programs leading to degrees from the baccalaureate to the doctorate. As Maryland’s preeminent public urban research university, Morgan fulfills its mission to address the needs and challenges of a distinctively urban environment. Since its inception, the University has graduated more than 55,000 degree recipients and presently retains an enrollment exceeding 8,000 students. Morgan alumni can be found in diverse leadership positions and have earned distinction in every field of academic and professional endeavor. Morgan is one of the nation’s most diverse Historically Black Colleges and Universities (HBCUs) and is the largest HBCU in the State of Maryland. The University’s impressive 185-acre campus has been recently designated as a National Treasure by the National Trust for Historic Preservation. Morgan State University (MSU) has a $1 billion economic impact in Greater Baltimore and the state of Maryland. In addition, the University directly or indirectly supports 6,900 jobs statewide each year. Alumni living and working in Maryland earn an estimated $535 million a year due to the education and credentials they earned from MSU. The University is fully accredited by the Middle States Commission on Higher Education and by the Maryland State Department of Education. The Academic Affairs Division of the University is organized around eleven schools/colleges: the James H. Gilliam, Jr. College of Liberal Arts, the School of Architecture and Planning, the Earl G. Graves School of Business and Management, the School of Community Health and Policy, the School of Computer, Mathematical and Natural Sciences, the School of Education and Urban Studies, the Clarence M. Mitchell School of Engineering, the School of Global Journalism and Communication, the School of Social Work, the College of Continuing Education"
  },
  {
    "page": 3,
    "text": "is one of the nation’s most diverse Historically Black Colleges and Universities (HBCUs) and is the largest HBCU in the State of Maryland. The University’s impressive 185-acre campus has been recently designated as a National Treasure by the National Trust for Historic Preservation. Morgan State University (MSU) has a $1 billion economic impact in Greater Baltimore and the state of Maryland. In addition, the University directly or indirectly supports 6,900 jobs statewide each year. Alumni living and working in Maryland earn an estimated $535 million a year due to the education and credentials they earned from MSU. The University is fully accredited by the Middle States Commission on Higher Education and by the Maryland State Department of Education. The Academic Affairs Division of the University is organized around eleven schools/colleges: the James H. Gilliam, Jr. College of Liberal Arts, the School of Architecture and Planning, the Earl G. Graves School of Business and Management, the School of Community Health and Policy, the School of Computer, Mathematical and Natural Sciences, the School of Education and Urban Studies, the Clarence M. Mitchell School of Engineering, the School of Global Journalism and Communication, the School of Social Work, the College of Continuing Education and Interdisciplinary Studies and the School of Graduate Studies.Institutional Profile LEADING THE FUTURE 3 MORGAN.EDU"
  },
  {
    "page": 4,
    "text": "The Morgan State University Leadership Imperative: A Message from the President At its core, this planning effort reflects our need to prepare the University for strategic growth and continued ascendency over the next ten years. Moreover, it reflects our concerted and continuous pursuit of excellence and a renewed commitment to fulfilling the University’s vital mission. Animated by that spirit, this plan (in large measure) focuses on human resource priorities, institutional capacity-building and the development of an organizational infrastructure that can best foster sustainable growth over the next ten years, and beyond. Embedded in this goal is our determination to realize greater operational excellence in our various organizational systems and processes and address needed improvements in our overall service delivery. A FOCUS ON LEADERSHIP This planning effort began in January 2020 with a thoughtful examination of our distinctive mission and a reaffirmation of the core values that have served this venerable institution well for so many years. Those enduring values remain an integral part of our institutional inheritance. Foremost among those bedrock values is the concept of leadership , in all of its forms and expressions. Since its inception in 1867, this institution has focused on the quintessential goal to prepare its students to assume dynamic leadership roles in their chosen professions and communities. Like any viable institution, Morgan State University continues to measure its success by the success of its students and alumni. And that is as it should be. Thus, a significant aspect of this plan focuses on creating a dynamic living-learning environment where student achievement is optimized and celebrated and where leadership development is a purposeful institutional goal. At Morgan, it is commonly understood that our emerging leaders will be mission-oriented and will ultimately aspire to be a force for good in the world. In brief, there has"
  },
  {
    "page": 4,
    "text": "greater operational excellence in our various organizational systems and processes and address needed improvements in our overall service delivery. A FOCUS ON LEADERSHIP This planning effort began in January 2020 with a thoughtful examination of our distinctive mission and a reaffirmation of the core values that have served this venerable institution well for so many years. Those enduring values remain an integral part of our institutional inheritance. Foremost among those bedrock values is the concept of leadership , in all of its forms and expressions. Since its inception in 1867, this institution has focused on the quintessential goal to prepare its students to assume dynamic leadership roles in their chosen professions and communities. Like any viable institution, Morgan State University continues to measure its success by the success of its students and alumni. And that is as it should be. Thus, a significant aspect of this plan focuses on creating a dynamic living-learning environment where student achievement is optimized and celebrated and where leadership development is a purposeful institutional goal. At Morgan, it is commonly understood that our emerging leaders will be mission-oriented and will ultimately aspire to be a force for good in the world. In brief, there has always been an explicit expectation that Morgan students and alumni would continue to heed the call to servant leadership, thereby dedicating themselves to the broader struggle of overcoming and eradicating barriers to social justice, economic empowerment and engaged citizenship. That leadership imperative is further expressed in our renewed strategic intention to deepen and expand our role as an anchor institution in Baltimore City and beyond.I take this opportunity to thank all who participated in and contributed to the formulation of this strategic plan. Our Transformation Morgan 2030: Leading the Future plan constitutes an amalgamation of vital inputs from various individual"
  },
  {
    "page": 4,
    "text": "its students to assume dynamic leadership roles in their chosen professions and communities. Like any viable institution, Morgan State University continues to measure its success by the success of its students and alumni. And that is as it should be. Thus, a significant aspect of this plan focuses on creating a dynamic living-learning environment where student achievement is optimized and celebrated and where leadership development is a purposeful institutional goal. At Morgan, it is commonly understood that our emerging leaders will be mission-oriented and will ultimately aspire to be a force for good in the world. In brief, there has always been an explicit expectation that Morgan students and alumni would continue to heed the call to servant leadership, thereby dedicating themselves to the broader struggle of overcoming and eradicating barriers to social justice, economic empowerment and engaged citizenship. That leadership imperative is further expressed in our renewed strategic intention to deepen and expand our role as an anchor institution in Baltimore City and beyond.I take this opportunity to thank all who participated in and contributed to the formulation of this strategic plan. Our Transformation Morgan 2030: Leading the Future plan constitutes an amalgamation of vital inputs from various individual shareholders and constituent groups who have given generously of their time and expertise to produce this blueprint for the strategic advancement of Morgan State University, 2021-2030. As in previous years, our consultative strategic planning processes have been both intentional and directional . I 2030Transformation MORGAN 4"
  },
  {
    "page": 5,
    "text": "A SEARCH FOR SOLUTIONS TO SOCIETY’S MOST PRESSING CHALLENGES Today, our sprawling campus provides indisputable evidence of a thriving living-learning environment populated by students, faculty and staff collectively committed to intellectual discovery, cutting- edge research and the interdisciplinary and transdisciplinary search for solutions to social problems that are growing in size and complexity. Of necessity, these inquiries must be fortified by the realization of internal synergies, new collaborative research agendas and effective synergistic partnerships with private organizations and governmental agencies operating in the public interest. In this regard, our plan boldly puts forth the goal of elevating Morgan State University as a leading and nationally-recognized research institution that has justifiably secured Carnegie classification as an “R1 institution.” Suffice it to say here, that the benefits of such an important designation are indeed sweeping and incalculable. EXPANDING OUR GLOBAL FOOTPRINT Finally, this plan reflects and affirms a distinctive strategic thrust to internationalize our curriculum and expand the University’s global footprint. In an age of rapid globalization, we seek to extend our reach into countries in critical need of educational services and interventions. This will require forging enduring cross-national partnerships, enhancing international student and faculty diversity on campus and developing effective models and educational delivery systems targeting underserved populations. We view such initiatives as a logical and necessary extension of the Morgan Global leadership imperative finding fuller expression on a much wider international stage. GROWING OUR RESOURCES In summary, the execution of this plan will require our best energies and an unwavering determination to give full expression to our longstanding leadership imperative. Yet as a practical matter, the fulfillment of this plan is largely resource-contingent . That said, we must embrace a well-coordinated and shared approach to institutional advancement aimed at significantly expanding our human and monetary resource base and reinforcing our"
  },
  {
    "page": 5,
    "text": "as a leading and nationally-recognized research institution that has justifiably secured Carnegie classification as an “R1 institution.” Suffice it to say here, that the benefits of such an important designation are indeed sweeping and incalculable. EXPANDING OUR GLOBAL FOOTPRINT Finally, this plan reflects and affirms a distinctive strategic thrust to internationalize our curriculum and expand the University’s global footprint. In an age of rapid globalization, we seek to extend our reach into countries in critical need of educational services and interventions. This will require forging enduring cross-national partnerships, enhancing international student and faculty diversity on campus and developing effective models and educational delivery systems targeting underserved populations. We view such initiatives as a logical and necessary extension of the Morgan Global leadership imperative finding fuller expression on a much wider international stage. GROWING OUR RESOURCES In summary, the execution of this plan will require our best energies and an unwavering determination to give full expression to our longstanding leadership imperative. Yet as a practical matter, the fulfillment of this plan is largely resource-contingent . That said, we must embrace a well-coordinated and shared approach to institutional advancement aimed at significantly expanding our human and monetary resource base and reinforcing our financial solvency in the years ahead. This can be best achieved by improving our private sector fundraising efforts and securing additional research and training grants that meet pressing human development and workforce needs. Ideally, this will entail the acquisition of more impactful and transformational gifts that enhance our capacities and meaningfully convey our overall investment-worthiness to the broader corporate and philanthropic community. Through this multidimensional plan, we intensify our culture of continuous improvement and set out on a journey beginning with a candid assessment of our institutional strengths, recognizing the tremendous challenges and opportunities that lay ahead. In retrospect, we"
  },
  {
    "page": 5,
    "text": "and educational delivery systems targeting underserved populations. We view such initiatives as a logical and necessary extension of the Morgan Global leadership imperative finding fuller expression on a much wider international stage. GROWING OUR RESOURCES In summary, the execution of this plan will require our best energies and an unwavering determination to give full expression to our longstanding leadership imperative. Yet as a practical matter, the fulfillment of this plan is largely resource-contingent . That said, we must embrace a well-coordinated and shared approach to institutional advancement aimed at significantly expanding our human and monetary resource base and reinforcing our financial solvency in the years ahead. This can be best achieved by improving our private sector fundraising efforts and securing additional research and training grants that meet pressing human development and workforce needs. Ideally, this will entail the acquisition of more impactful and transformational gifts that enhance our capacities and meaningfully convey our overall investment-worthiness to the broader corporate and philanthropic community. Through this multidimensional plan, we intensify our culture of continuous improvement and set out on a journey beginning with a candid assessment of our institutional strengths, recognizing the tremendous challenges and opportunities that lay ahead. In retrospect, we have advanced as a venerable, service-oriented institution rooted in and rigorously reaffirming its core values. Today, we constitute a dynamic living-learning community that embraces the same sentiment and pursuit of excellence invoked by our campus designation as “a national treasure.” In outlook, we are clearly a dynamic institution poised for greatness and strategic growth on an unprecedented scale. This is work that is undeniably worthy of our time, talent and treasure. This is the necessary and ennobling work that will enable us to harness our collective strengths and solidify our future. This is visionary and constructive work that will ensure"
  },
  {
    "page": 5,
    "text": "financial solvency in the years ahead. This can be best achieved by improving our private sector fundraising efforts and securing additional research and training grants that meet pressing human development and workforce needs. Ideally, this will entail the acquisition of more impactful and transformational gifts that enhance our capacities and meaningfully convey our overall investment-worthiness to the broader corporate and philanthropic community. Through this multidimensional plan, we intensify our culture of continuous improvement and set out on a journey beginning with a candid assessment of our institutional strengths, recognizing the tremendous challenges and opportunities that lay ahead. In retrospect, we have advanced as a venerable, service-oriented institution rooted in and rigorously reaffirming its core values. Today, we constitute a dynamic living-learning community that embraces the same sentiment and pursuit of excellence invoked by our campus designation as “a national treasure.” In outlook, we are clearly a dynamic institution poised for greatness and strategic growth on an unprecedented scale. This is work that is undeniably worthy of our time, talent and treasure. This is the necessary and ennobling work that will enable us to harness our collective strengths and solidify our future. This is visionary and constructive work that will ensure our institutional viability well into the 21st century. A NEW DECADE OF STRA TEGIC GROWTH Today, we stand poised to usher in a new decade of strategic growth; one that will build upon Morgan State University’s well-earned reputation as an institutional leader and a dynamic training ground for the education of responsible and responsive leaders, particularly at a time such as this. Through this plan, our time-honored mission will be fulfilled as we chart an intentional pathway to meet contemporary and foreseeable challenges and opportunities and effectively position Morgan State University in the forefront of the higher educational enterprise. This"
  },
  {
    "page": 5,
    "text": "have advanced as a venerable, service-oriented institution rooted in and rigorously reaffirming its core values. Today, we constitute a dynamic living-learning community that embraces the same sentiment and pursuit of excellence invoked by our campus designation as “a national treasure.” In outlook, we are clearly a dynamic institution poised for greatness and strategic growth on an unprecedented scale. This is work that is undeniably worthy of our time, talent and treasure. This is the necessary and ennobling work that will enable us to harness our collective strengths and solidify our future. This is visionary and constructive work that will ensure our institutional viability well into the 21st century. A NEW DECADE OF STRA TEGIC GROWTH Today, we stand poised to usher in a new decade of strategic growth; one that will build upon Morgan State University’s well-earned reputation as an institutional leader and a dynamic training ground for the education of responsible and responsive leaders, particularly at a time such as this. Through this plan, our time-honored mission will be fulfilled as we chart an intentional pathway to meet contemporary and foreseeable challenges and opportunities and effectively position Morgan State University in the forefront of the higher educational enterprise. This is a vision that is truly worthy of renewed dedication and our best efforts. This is a bold undertaking, grounded in our institutional legacy and focused on a future marked by academic preeminence and the realization of limitless possibilities! Morgan aims to grow the future in talent development in producing evidenced- based research addressing urban challenges through innovation. I invite you to partner with us in advancing this shared vision. David K. Wilson President LEADING THE FUTURE 5 MORGAN.EDU"
  },
  {
    "page": 6,
    "text": "Statement VISION Morgan State University is the premier public urban research university in Maryland, known for excellence in teaching, intensive research, effective public service and community engagement. Morgan prepares diverse and competitive graduates for success in a global, interdependent society. 2030Transformation MORGAN 6"
  },
  {
    "page": 7,
    "text": "MISSIONOur Morgan State University serves the community, region, state, nation and world as an intellectual and creative resource by supporting, empowering and preparing high-quality, diverse graduates to lead the world. The University offers innovative, inclusive and distinctive educational experiences to a broad cross- section of the population in a comprehensive range of disciplines at the baccalaureate, master’s, doctoral and professional degree levels. Through collaborative pursuits, scholarly research, creative endeavors and dedicated public service, the University gives significant priority to addressing societal problems, particularly those prevalent in urban communities. LEADING THE FUTURE 7 MORGAN.EDU"
  },
  {
    "page": 8,
    "text": "V ALUESOur Core Morgan seeks to provide rigorous academic curricula and challenging co-curricular opportunities to promote the development of leadership qualities in students and to facilitate leadership development among faculty, staff, and students. Leadership Morgan encourages and supports its faculty, staff, and students in all forms of scholarship including the discovery and application of knowledge in teaching and learning and in developing innovative products and processes.InnovationMorgan expects honest communication, ethical behavior, and accountability for words and deeds from all members of the University community.Integrity 2030Transformation MORGAN 8"
  },
  {
    "page": 9,
    "text": "T o ensure institutional effectiveness and efficiency, Morgan continuously pursues excellence in teaching, research, scholarship, creative endeavors, student services and all aspects of the University’s operation.ExcellenceMorgan welcomes and supports a broad diversity of people and ideas as essential to quality education in a global interdependent society. Students will have reasonable and affordable access to a comprehensive range of high-quality educational programs and services.Diversity Morgan treats each person equitably with respect and dignity in all situations.Respect LEADING THE FUTURE 9 MORGAN.EDU"
  },
  {
    "page": 10,
    "text": "FOUNDA TION Building on a Solid 2030Transformation MORGAN 10"
  },
  {
    "page": 11,
    "text": "FUTURE… Carrying Our Vision and Values into the LEADING THE FUTURE 11 MORGAN.EDU"
  },
  {
    "page": 12,
    "text": "STRA TEGIC PLANNING at Morgan State University 2030Transformation MORGAN 12"
  },
  {
    "page": 13,
    "text": "N Now more than ever, institutions of higher learning have had to rethink their business models and conduct strategic planning, particularly in an indefinite and increasingly competitive educational marketplace. Most recently, the ongoing COVID pandemic has tested the adaptability and agility of colleges and universities, forcing them to effectively pivot and quickly adopt new methods of educational service delivery that are safe, effective and cost efficient. In addition, shifting demographic trends and economic considerations are fueling a preference for asynchronous learning and a heightened demand for more flexible and affordable on-line educational options. In a broader perspective, racial and social injustices, health disparities, and economic inequalities are bringing into sharper focus the roles progressive colleges and universities might play in formulating and implementing interdisciplinary and innovative solutions to these problems. The escalating scale and complexity of these problems will require thoughtful collaboration with other responsive organizations and agencies. Operating in this context, Morgan State University is obliged to reexamine its strategic directions and forge new strategic partnerships, predicated on its research aspirations and the fulfillment of its distinctive urban mission. At the center of our planning efforts is a transformational vision to grow and position Morgan State University as a dynamic epicenter for the convergence of scholarship, research and advocacy. Thus, we are determined to play a preeminent role in the cross-fertilization, integration and application of ideas, practices and pedagogies that promote scientific and technological innovation, entrepreneurial prowess and dynamic leadership for a global community in pursuit of economic justice and sustainable peace and prosperity. LEANING FORW ARD: THE STRA TEGIC PLANNING IMPERA TIVE OUR STRA TEGIC PLANNING PROCESSES With the endorsement and support of the University’s Board of Regents, President David K. Wilson was tasked with engaging the campus community and the University’s various constituency groups in the development"
  },
  {
    "page": 13,
    "text": "injustices, health disparities, and economic inequalities are bringing into sharper focus the roles progressive colleges and universities might play in formulating and implementing interdisciplinary and innovative solutions to these problems. The escalating scale and complexity of these problems will require thoughtful collaboration with other responsive organizations and agencies. Operating in this context, Morgan State University is obliged to reexamine its strategic directions and forge new strategic partnerships, predicated on its research aspirations and the fulfillment of its distinctive urban mission. At the center of our planning efforts is a transformational vision to grow and position Morgan State University as a dynamic epicenter for the convergence of scholarship, research and advocacy. Thus, we are determined to play a preeminent role in the cross-fertilization, integration and application of ideas, practices and pedagogies that promote scientific and technological innovation, entrepreneurial prowess and dynamic leadership for a global community in pursuit of economic justice and sustainable peace and prosperity. LEANING FORW ARD: THE STRA TEGIC PLANNING IMPERA TIVE OUR STRA TEGIC PLANNING PROCESSES With the endorsement and support of the University’s Board of Regents, President David K. Wilson was tasked with engaging the campus community and the University’s various constituency groups in the development of a ten-year strategic plan covering the period, 2021-2030. Such a plan was viewed as a logical extension of the University’s previous strategic plan entitled, Growing the Future, Leading the World: The Strategic Plan for Morgan State University, 2011- 2021. As envisioned, the resultant strategic plan would help to strategically position and advance the University along carefully chosen lines of established excellence and opportunity. Building on the success of the previous planning effort and the subsequent growth of the University over the past ten years, a new and equally inclusive strategic plan was imagined. As in the previous undertaking, this"
  },
  {
    "page": 13,
    "text": "dynamic epicenter for the convergence of scholarship, research and advocacy. Thus, we are determined to play a preeminent role in the cross-fertilization, integration and application of ideas, practices and pedagogies that promote scientific and technological innovation, entrepreneurial prowess and dynamic leadership for a global community in pursuit of economic justice and sustainable peace and prosperity. LEANING FORW ARD: THE STRA TEGIC PLANNING IMPERA TIVE OUR STRA TEGIC PLANNING PROCESSES With the endorsement and support of the University’s Board of Regents, President David K. Wilson was tasked with engaging the campus community and the University’s various constituency groups in the development of a ten-year strategic plan covering the period, 2021-2030. Such a plan was viewed as a logical extension of the University’s previous strategic plan entitled, Growing the Future, Leading the World: The Strategic Plan for Morgan State University, 2011- 2021. As envisioned, the resultant strategic plan would help to strategically position and advance the University along carefully chosen lines of established excellence and opportunity. Building on the success of the previous planning effort and the subsequent growth of the University over the past ten years, a new and equally inclusive strategic plan was imagined. As in the previous undertaking, this new plan similarly takes into consideration the University’s strengths and underscores the importance of synergistic engagements with organizations and agencies based on a solid mutuality of purpose. Likewise, this updated plan surveys the higher educational landscape to determine current and foreseeable demographic and workforce trends and critical needs throughout the Greater Baltimore region, the nation at large and the global community. From the outset, our Transformation Morgan 2030 plan involved a decidedly transparent and consultative process. Accordingly, President Wilson launched this planning initiative in January 2020 by appointing a Strategic Planning Steering Committee to be chaired by Dr. Don-Terry Veal,"
  },
  {
    "page": 13,
    "text": "of a ten-year strategic plan covering the period, 2021-2030. Such a plan was viewed as a logical extension of the University’s previous strategic plan entitled, Growing the Future, Leading the World: The Strategic Plan for Morgan State University, 2011- 2021. As envisioned, the resultant strategic plan would help to strategically position and advance the University along carefully chosen lines of established excellence and opportunity. Building on the success of the previous planning effort and the subsequent growth of the University over the past ten years, a new and equally inclusive strategic plan was imagined. As in the previous undertaking, this new plan similarly takes into consideration the University’s strengths and underscores the importance of synergistic engagements with organizations and agencies based on a solid mutuality of purpose. Likewise, this updated plan surveys the higher educational landscape to determine current and foreseeable demographic and workforce trends and critical needs throughout the Greater Baltimore region, the nation at large and the global community. From the outset, our Transformation Morgan 2030 plan involved a decidedly transparent and consultative process. Accordingly, President Wilson launched this planning initiative in January 2020 by appointing a Strategic Planning Steering Committee to be chaired by Dr. Don-Terry Veal, the University’s Chief of Staff. The Committee was comprised of faculty, students, staff, alumni, administrators, deans and representatives from the local community. This committee adopted guiding principles that were closely followed. Those principles were intentionally consistent with the University’s mission, vision and core values. The committee then developed and executed a structured and methodical planning process. Project tasks, milestones, and deliverables were identified and approved. This entailed conducting internal environmental scans to determine the current state of affairs in key units and departments and collecting and interpreting data from various internal sources including, but not limited to: The LEADING THE"
  },
  {
    "page": 13,
    "text": "new plan similarly takes into consideration the University’s strengths and underscores the importance of synergistic engagements with organizations and agencies based on a solid mutuality of purpose. Likewise, this updated plan surveys the higher educational landscape to determine current and foreseeable demographic and workforce trends and critical needs throughout the Greater Baltimore region, the nation at large and the global community. From the outset, our Transformation Morgan 2030 plan involved a decidedly transparent and consultative process. Accordingly, President Wilson launched this planning initiative in January 2020 by appointing a Strategic Planning Steering Committee to be chaired by Dr. Don-Terry Veal, the University’s Chief of Staff. The Committee was comprised of faculty, students, staff, alumni, administrators, deans and representatives from the local community. This committee adopted guiding principles that were closely followed. Those principles were intentionally consistent with the University’s mission, vision and core values. The committee then developed and executed a structured and methodical planning process. Project tasks, milestones, and deliverables were identified and approved. This entailed conducting internal environmental scans to determine the current state of affairs in key units and departments and collecting and interpreting data from various internal sources including, but not limited to: The LEADING THE FUTURE 13 MORGAN.EDU"
  },
  {
    "page": 14,
    "text": "Office of Institutional Research, the Office of Human Resources, the Office of Finance and Management and the Office of Enrollment Management. In addition, the Committee administered surveys and conducted focus groups and town hall meetings. The committee also received analytical reports from consultants and senior management and staff; reviewed existing divisional goals; determined ways to minimize risk and maximize success by conducting SWOT (strengths, weaknesses, opportunities, and threats) analyses and mapped resources to strategic initiatives thereby demonstrating how those initiatives might be adequately funded and supported over a multi-year period. In addition, it proposed key performance metrics and memorialized all work and recommendations put forth in a final report. Subcommittees were formed and various tasks assigned to each. Subcommittees worked in a way to integrate strategies and scrutinize their results. Their overall process is depicted in Figure 1 below. SUBCOMMITTEE PROCESS Figure 1 2030Transformation MORGAN 14"
  },
  {
    "page": 15,
    "text": "An external consultant met with the committee to ensure that it considered national as well as global issues and trends that are projected to significantly impact the University. This consultant also proposed sufficient quantitative benchmarks to permit the measurement of the committee’s proposed goals and objectives. Sample issues that were discussed are cited in Figure 2 below. 9 DURABLE HIGHER EDUCA TION TRENDS AMPLIFIED BY COVID-19 1 Demographic Cliff High school graduates and international student demand will peak in 2026 and sharply decline.2 Diversity & Inclusion Imperative Struggle to close high achievement gap persists while incoming student body is increasingly diverse. 3 Affordability & Value Misunderstood High school graduates and international student demand will peak in 2026 and sharply decline. 4 Increasing Recognition of Student Mental Health Needs Mental and emotional health issues are on the rise and will continue to increase.5 Diversity & Inclusion Imperative COVID-19 forced remote learning adoption quickly and this trend appears to be increasing at an accelerated pace.6 EdT ech Brings New Enablers & Competitors Tech has spread rapidly and provides higher education with new enablers while introducing competition and disruptions. 7 Future of Work is Now and in a Sharp Downturn Automation has had an unprecedented impact on work and graduates will have difficulty finding employment.8 Interdisciplinary Research Becomes the Norm in the Battle for Funding Federal funding decreases while research landscape reorganizes to focus on interdisciplinary and new capabilities. 9 Financial Instability Brings Consolidation & Stressors Financial pressures are increasing amidst State funding cuts and industry consolidation and closures. Figure 2 LEADING THE FUTURE 15 MORGAN.EDU"
  },
  {
    "page": 16,
    "text": "Our Strengths 1. Strong brand and reputation as a producer of longstanding leadership in government, civil rights and social advocacy. 2. A recognized leader in graduating African Americans entering the STEM disciplines. 3. Strong, visionary executive leadership and management team. 4. Solid fiscal management and bond ratings. 5. Strong financial health. 6. An aggressive campus master plan that is constantly adding new state-of-the-art facilities. 7. Healthy shared governance process, constituent engagement, and broad-based support. 8. Diverse, dedicated, and expert faculty, administrators, and staff. 9. Comprehensive educational system that continuously adds innovative and high-demand academic programs with specialized accreditation. 10. A continuous focus on improving student success, including retention and graduation. 11. Comprehensive and individualized support structure that transforms students of every background to excel and overcome difficult socio-economic barriers. 12. Emphasis on student life and engagement fostering leadership potential. 13. Ever-expanding global footprint and strategic international and domestic academic program and student internship partnerships. 14. Growing diverse student body and a welcoming, inclusive environment. 15. Great financial value for the quality of education received. 16. Advanced research capabilities and strong business/industry relationships. 17. Recognized institutional leader in the performing arts. 18. Athletics program producing several Hall of Fame athletes. 19. Geographic location (proximity to Washington DC and the tri-state area).CHARTING INSTITUTIONAL STRENGTHS AND OPPORTUNITIES Of a preliminary nature, the Steering Committee took stock of a number of notable institutional strengths that point to opportunities for sustainable growth. These strengths provide competitive advantages that can and should be effectively leveraged over the next ten years. 2030Transformation MORGAN 16"
  },
  {
    "page": 17,
    "text": "12. Build state-of-the-art laboratories. 13. Increase interdisciplinary projects through strategic partnerships and interdisciplinary collaborations. 14. Improve infrastructure and optimize key business processes and supporting technologies. 15. Strengthen the relationship with local and global communities and foster greater economic, civic, and cultural development in the region through applied research and advocacy to help mitigate and help solve critical urban issues. 16. Administer and market personal enrichment and professional development education and training programs and create/facilitate internship and apprenticeship opportunities. 17. Make the University’s state-of-the-art facilities available to the public through strategic programming. 18. Expand programs to revitalize local neighborhoods and make a lasting impact on the quality of life of its residents. 19. Explore partnering with and bringing to campus an established and reputable school of osteopathic medicine. 20. Develop and institute a comprehensive renewable and sustainable energy plan.Our Opportunities and Aspirations 1. Become a global educational enterprise. 2. Enhance the educational experience of students thereby preparing them to be responsible global citizens. 3. Expand and increase access to education and modes of delivery (robust online presence). 4. Further develop more actively charged living and learning communities. 5. Devise and execute a plan to reach the Carnegie R1 classification. 6. Expand and improve institutional advancement processes with a view to cultivate major gifts and transformational investments. 7. Stimulate alumni giving and involvement. 8. Grow sponsored award revenue and expenditures to at least $50M per year. 9. Strategically add doctoral programs in the humanities and social sciences. 10. Invest in strategic growth clusters and funding mechanisms. 11. Attract and retain additional quality ladder ranked faculty and staff dedicated to research (e.g. doctorate-holding non-faculty researchers or NFRs) and make more teaching assistantships available. LEADING THE FUTURE 17 MORGAN.EDU"
  },
  {
    "page": 18,
    "text": "AACCENTUA TING OUR URBAN MISSION Today, Morgan State University fully embraces its designation as the State of Maryland’s preeminent urban research institution. Accordingly, this strategic plan was informed by a variety of external scans and an examination of the actual and aspirational thrusts of recognized peer institutions that have an established urban presence. Particular attention was paid to those that aspire to even higher levels of civic engagement and have involved themselves in initiatives that serve the educational, social and economic needs of underserved urban populations. Some of these aspirational peer institutions included: The University of Wisconsin–Milwaukee, Portland State University, Cleveland State University, Temple University and Georgia State University. This strategic plan draws upon some of their benchmarks and relative examples and successes in forging strategic partnerships with governmental and non-profit organizations across interdisciplinary lines of community service and neighborhood revitalization. CRITICAL GAP ANAL YSES This plan was also informed by critical gap analyses that assessed the University’s overall progress toward the attainment of its stated 2010-2021 goals. These analyses allowed various units and departments to: 1) utilize key performance indicators to gauge their level of change and improvement over the past ten years 2) target areas of needed improvement, and 3) determine if their previously stated goals should be reaffirmed, modified or updated. In this regard, their various analyses provided opportunities to share critical feedback regarding ways for the University to successively transform itself on every level. 2030Transformation MORGAN 18"
  },
  {
    "page": 19,
    "text": "STRA TEGIC GOALS 2021–2030 AAs this strategic planning process gradually unfolded, there was broad consensus that the University’s emerging 2021–2030 strategic goals were notably consistent with its previously stated 2010–2021 goals. In essence, it was determined that those previously stated goals were interconnected and worthy of sustainable emphases. That being the case, the Strategic Planning Steering Committee decided to reaffirm and reformulate six interdependent strategic goals that required significant focusing and explication in light of critical gap analyses, relevant trend data, updated resource needs and emerging growth opportunities over an ensuing ten-year planning horizon. These six interconnected strategic goals (briefly described below) give shape and add focus and renewed expression to our previously articulated strategic goals. In the aggregate, they provide a framework for managing needed organizational change and preparing the University to serve and compete at the highest attainable level. LEADING THE FUTURE 19 MORGAN.EDU"
  },
  {
    "page": 20,
    "text": "Enhance Student Success and Well-Being Goal 1 The University will implement a broad range of human resource development initiatives for the benefit of faculty and staff. These initiatives will facilitate the ascendency of faculty to higher ranks and provide staff with progressive opportunities for professional development and merit-based promotions. Without question, a sharp focus on effective human resource planning will have a direct and determinative bearing on the execution of our overall strategic plan. Over the next ten years, the University will need to attract, retain and promote junior and senior faculty. Also, staff will require opportunities to retool and acquire specialized skills leading to professional growth and enhanced opportunities for promotion and progressive compensation.Morgan strives to create an educational environment that enhances student success by offering new academic programs and holistic co- curricular activities in a welcoming, diverse and inclusive campus community. The goal here is to provide students with a comprehensive educational and transformative experience that actualizes their full potential and empowers them to emerge as confident and competent global citizens and dynamic leaders in their selected careers and communities. This broadly stated goal encompasses student enrollment and retention functions. Thus, primary and cross-sectional responsibility for all of these functional areas is jointly shared by the Provost & Senior Vice President, the Vice President for Enrollment Management and Student Success (EMASS) and the Vice President for Student Affairs. Implement Faculty Ascendency and Staff Development InitiativesGoal 2 2030Transformation MORGAN 20"
  },
  {
    "page": 21,
    "text": "Morgan will advance new construction, capital improvement, deferred maintenance, and campus safety projects in keeping with the University’s evolving master plan. The University will also implement an information technology plan to accommodate and optimize operational excellence in all aspects of its service delivery. This expanded and improved infrastructure will accommodate a projected increase in student enrollment (traditional and non-traditional) and a surging demand for on-line learning options. This goal also encompasses a number of recommendations to implement campus-wide safety measures and enhance student well-being.Over the next ten years, Morgan will emerge as a R1 doctoral research university fully engaged in basic and applied research and creative interdisciplinary inquiries undergirded and sustained through increased research grants and contracts. The realization of this goal is predicated on a distinctive MSU faculty presence and preeminence in STEM and non-STEM disciplines and the strengthening of an effective educational pipeline advancing students from the baccalaureate to the doctoral level. This is an institution-wide goal to be pursued at the enterprise level. Primary responsibility for achieving this goal rests with the Vice President for Research and Economic Development working in close, inter-office collaboration with the Provost, Deans, Faculty and all members of the President’s senior administrative team.Elevate Morgan’s Status to R1 Very High Doctoral Research University Goal 3 Expand and Improve a Campus-Wide Infrastructure to Support Operational Excellence and Increase Overall Institutional Capacity Goal 4 LEADING THE FUTURE 21 MORGAN.EDU"
  },
  {
    "page": 22,
    "text": "Morgan will enhance its study abroad program and promote global awareness and intercultural competencies through its diverse curricular and co-curricular programs and activities. The University will also increase international student enrollment and leverage its ongoing presence in West Africa to develop effective and replicable models of excellence in international development and responsive, market-based educational service delivery in Latin America and the Caribbean nations.Morgan will expand and deepen its role as a recognized anchor institution with broad social and economic impact. The University will engage community residents and officials in the application of knowledge and policy analyses derived from faculty and student research, an appropriate sharing of mutually beneficial resources and the deployment and utilization of University experts and professionals to address local and regional concerns in the areas of public education, housing, safety, employment and neighborhood revitalization. In this way, Morgan State University will serve as a dynamic epicenter dedicated to the generation, integration and dissemination of new knowledge as a driving force to effect policy and catalyze meaningful social change. Morgan State University faculty and students will be actively involved in this work. Previous activities drew upon the expertise and experience found in outstanding academic units such as the School of Architecture and Planning, the School of Business and Management, the School of Community Health and Policy, the School of Computer, Mathematical and Natural Sciences, the School of Engineering, the School of Global Journalism and Communication, the School of Social Work and the School of Graduate Studies. The School of Education and Urban Studies (SEUS) in particular will play a pivotal role in generating research that is specific to the needs of urban K-20 learners in the city and state, and in the design and implementation of research-based interventions that are targeted to the needs of local residents.Serve as"
  },
  {
    "page": 22,
    "text": "student research, an appropriate sharing of mutually beneficial resources and the deployment and utilization of University experts and professionals to address local and regional concerns in the areas of public education, housing, safety, employment and neighborhood revitalization. In this way, Morgan State University will serve as a dynamic epicenter dedicated to the generation, integration and dissemination of new knowledge as a driving force to effect policy and catalyze meaningful social change. Morgan State University faculty and students will be actively involved in this work. Previous activities drew upon the expertise and experience found in outstanding academic units such as the School of Architecture and Planning, the School of Business and Management, the School of Community Health and Policy, the School of Computer, Mathematical and Natural Sciences, the School of Engineering, the School of Global Journalism and Communication, the School of Social Work and the School of Graduate Studies. The School of Education and Urban Studies (SEUS) in particular will play a pivotal role in generating research that is specific to the needs of urban K-20 learners in the city and state, and in the design and implementation of research-based interventions that are targeted to the needs of local residents.Serve as the Premier Anchor Institution for Baltimore City and Beyond Goal 5 Accelerate Global Education Initiatives and Expand the University’s International Footprint Goal 6 2030Transformation MORGAN 22"
  },
  {
    "page": 23,
    "text": "STRA TEGIC PRIORITIES & BENCHMARKS 2021–2030 IIn pursuit of these six interdependent goals, the Strategic Planning Committee compiled a broad range of programmatic and operational suggestions along with actionable recommendations for change. Due to resource and staffing limitations, not all of these recommendations could be marked for immediate or gradual implementation over a ten-year planning horizon. Still, the compendium below provides a glance of strategic priorities and corresponding implementation goals and benchmarks to mark and measure the University’s progressive transformation over the next ten years. LEADING THE FUTURE 23 MORGAN.EDU"
  },
  {
    "page": 24,
    "text": "PROJECTED STUDENT ENROLLMENT AND RETENTION 7 Increase enrollment to 10,000 by the Fall, 2030 through robust on-line offerings and aggressive recruitment and marketing initiatives. 7 Double the number of enrolled international students from 400 to 800 in ten years. 7 Maintain 70% or higher first-to-second year retention rate. Reach 50% or higher six-year graduation rate by 2025. Reach 60% or higher six- year graduation rate by 2030. 7 Graduate Morgan’s first Rhodes, Newman and Marshall Scholars. 7 By 2030, firmly establish and position Morgan to be amongst the top five institutions in the nation in the production of Blacks in STEM fields at the undergraduate level, and a top producer of Blacks who go on to medical school and PhD programs in engineering, the natural and social sciences, education and related fields. 7 Launch the Morgan Completes You Initiative with the following enrollment and degree completion projections: Degree Level Y ear 1 Y ear 2 Y ear 3 Y ear 4 Y ear 5 Bachelor’s 493 986 1480 1973 2466 Master’s 55 110 166 221 276 Doctoral 52 103 155 206 258 T otal 600 1200 1800 2400 3000 7 Through an annual assessment, employers of Morgan graduates will rank their satisfaction with the level of preparedness and job- readiness of MSU graduates at the 90th percentile or higher.Enhance Student Success and Well-Being Goal 1 2030Transformation MORGAN 24"
  },
  {
    "page": 25,
    "text": "MORGAN A THLETICS The overarching goal of the intercollegiate athletics program is to provide a holistic student-athlete experience, designed to create leaders in the classroom, in athletic competition and in their lifelong endeavors. Academic achievement and competitive excellence are two core areas of emphasis for athletics that will directly support Morgan’s strategic goal to enhance student success and well-being. 7 Over the next ten years, the athletics department will focus on coach and staff development. 7 During this period, the University will advance the development of its athletics facility master plan. Targeted investments in its athletic infrastructure and facilities will enhance operational excellence and ideally position Morgan athletics to achieve success on a regional and national scale. PROMOTING STUDENT DEVELOPMENT THROUGH NEW ACADEMIC PROGRAMMING AND HOLISTIC CO- CURRICULAR ACTIVITIES The Steering Committee also received and discussed a number of viable programmatic interventions and enhancements. This process eventually led to the recommendation to create three new deliberative bodies charged with the responsibility to access the advisability and feasibility of all proposed (actionable) items based on anticipated measurable outcomes, cost-benefit considerations and sustainability over a ten-year period. By agreement, these three deliberate bodies would be created as standing committees, chaired and appointed by an appropriate Vice President. They are: 1) an Academic Advisory Council, 2) a Commission on Diversity and 3) a reactivated LGBTQIA Advisory Council. Over the next ten years, each will be expected to produce comprehensive annual progress reports. LEADING THE FUTURE 25 MORGAN.EDU"
  },
  {
    "page": 26,
    "text": "Human resource planning is essential to the implementation of this strategic plan and will profoundly influence the achievement of its stated objectives. At Morgan State University, our faculty remain at the center of our academic enterprise. The ongoing dedication, competencies and aspirations of the faculty will propel our forward institutional advancement and profoundly influence our teaching- learning environment in ways that are multitudinous and far-reaching. The bold vision animating our Transformation Morgan 2030 plan fully acknowledges the critical role faculty will play in the near and distant future. Our stellar faculty will be instrumental in promoting a culture of discovery, innovation and entrepreneurship throughout our learning community and most importantly, empower students to emerge from their educational experiences prepared to lead the world. Consequently, new faculty ascendency and development initiatives will inextricably and simultaneously reinforce the University’s steady progression toward R1 research status and the achievement of its globalization goals and objectives. F ACULTY ASCENDENCY AND DEVELOPMENT INITIA TIVES Over the next ten years, the University will enhance its capability to attract and retain high-caliber academic talent to the Morgan campus. In part, this will be achieved through the establishment of a minimum of ten (10) funded endowed chairs in vitally important academic areas, particularly those that encourage interdisciplinary and transdisciplinary collaborative research. Secondly, we intend to invest in pedagogical development initiatives for faculty serving at all levels, focusing on proven assessment tools and the utilization of new and emerging technologies in the classroom. The University will also target a specific percentage of faculty receiving advanced training such as Quality Matters to promote and improve the quality of its online educational offerings. Through these means, we seek to significantly enhance student learning as the University adopts new methods of educational service delivery that accommodate traditional and nontraditional learners. Also, the"
  },
  {
    "page": 26,
    "text": "innovation and entrepreneurship throughout our learning community and most importantly, empower students to emerge from their educational experiences prepared to lead the world. Consequently, new faculty ascendency and development initiatives will inextricably and simultaneously reinforce the University’s steady progression toward R1 research status and the achievement of its globalization goals and objectives. F ACULTY ASCENDENCY AND DEVELOPMENT INITIA TIVES Over the next ten years, the University will enhance its capability to attract and retain high-caliber academic talent to the Morgan campus. In part, this will be achieved through the establishment of a minimum of ten (10) funded endowed chairs in vitally important academic areas, particularly those that encourage interdisciplinary and transdisciplinary collaborative research. Secondly, we intend to invest in pedagogical development initiatives for faculty serving at all levels, focusing on proven assessment tools and the utilization of new and emerging technologies in the classroom. The University will also target a specific percentage of faculty receiving advanced training such as Quality Matters to promote and improve the quality of its online educational offerings. Through these means, we seek to significantly enhance student learning as the University adopts new methods of educational service delivery that accommodate traditional and nontraditional learners. Also, the University will be investing in a number of faculty development initiatives designed to benefit both junior-level and senior-level faculty. Implement Faculty Ascendency and Staff Development InitiativesGoal 2 2030Transformation MORGAN 26"
  },
  {
    "page": 27,
    "text": "ST AFF DEVELOPMENT University staff will continue to play an equally valuable role in the foreseeable future. These non-faculty personnel provide student support services and manage residential and non-residential extracurricular programs. Accordingly, this plan underscores the importance of annually evaluating the professional conduct of non-faculty staff who are expected to uphold the highest standards of professional conduct and serve as positive role models in the campus living-learning community. In addition, office support staff will be instrumental in the University’s pursuit of operational excellence. Over the next ten years, the University will make a concerted effort to encourage staff participation in pre- existing and anticipated professional development activities and incentivize the completion of specialized customer-service training for the benefit of diverse functional and public-facing units. Toward these ends, the Office of Human Resources will explore the feasibility of establishing “job families” comprised of a series of related job titles with progressively higher levels of knowledge, competencies and professional qualities that ultimately lead to meritorious promotional opportunities over time. A job family will be defined as a series of related job titles with progressively higher levels of knowledge, competencies and demonstrated professional qualities. Such promotions will be based upon supervisor recommendations, the specific needs of a given department or unit and their concurrence with annual budget cycles. These promotions will be noncompetitive and will focus on the individual’s contributions to his/her department’s efficiency, its image and its overall level of customer service. Considerations may also include the individual’s participation in external job enrichment activities, degree completion, job rotation and diversified on-the-job training activities. Conduct a thorough needs assessment of employee competency levels, job satisfaction and career aspirations Where appropriate, the Office of Human Resources will create and manage Job Family Committees charged with the responsibility to oversee and evaluate all staff training"
  },
  {
    "page": 27,
    "text": "pre- existing and anticipated professional development activities and incentivize the completion of specialized customer-service training for the benefit of diverse functional and public-facing units. Toward these ends, the Office of Human Resources will explore the feasibility of establishing “job families” comprised of a series of related job titles with progressively higher levels of knowledge, competencies and professional qualities that ultimately lead to meritorious promotional opportunities over time. A job family will be defined as a series of related job titles with progressively higher levels of knowledge, competencies and demonstrated professional qualities. Such promotions will be based upon supervisor recommendations, the specific needs of a given department or unit and their concurrence with annual budget cycles. These promotions will be noncompetitive and will focus on the individual’s contributions to his/her department’s efficiency, its image and its overall level of customer service. Considerations may also include the individual’s participation in external job enrichment activities, degree completion, job rotation and diversified on-the-job training activities. Conduct a thorough needs assessment of employee competency levels, job satisfaction and career aspirations Where appropriate, the Office of Human Resources will create and manage Job Family Committees charged with the responsibility to oversee and evaluate all staff training and promotion activities and programs. These committees will screen all applications for job family promotions and review and make recommendations regarding training and other requirements necessary to advance through a given job family. The following objectives will be pursued. 7 Morgan will launch a professional development program for tenured Associate Professors designed to help expand their academic portfolios (through re- engagement in cutting-edge research and creative activities ) and make them more competitive for promotion to the rank of full professor; 7 By 2030, Morgan will establish a minimum of ten (10) endowed professorships to recruit, attract and retain leading"
  },
  {
    "page": 27,
    "text": "specific needs of a given department or unit and their concurrence with annual budget cycles. These promotions will be noncompetitive and will focus on the individual’s contributions to his/her department’s efficiency, its image and its overall level of customer service. Considerations may also include the individual’s participation in external job enrichment activities, degree completion, job rotation and diversified on-the-job training activities. Conduct a thorough needs assessment of employee competency levels, job satisfaction and career aspirations Where appropriate, the Office of Human Resources will create and manage Job Family Committees charged with the responsibility to oversee and evaluate all staff training and promotion activities and programs. These committees will screen all applications for job family promotions and review and make recommendations regarding training and other requirements necessary to advance through a given job family. The following objectives will be pursued. 7 Morgan will launch a professional development program for tenured Associate Professors designed to help expand their academic portfolios (through re- engagement in cutting-edge research and creative activities ) and make them more competitive for promotion to the rank of full professor; 7 By 2030, Morgan will establish a minimum of ten (10) endowed professorships to recruit, attract and retain leading scholars in the nation; 7 Invest in pedagogical development for faculty at all levels focusing on assessment tools and the utilization of new and emerging technologies in the classroom; 7 Annually target a specific percentage of faculty receiving Quality Matters training to promote and improve the quality of online education and enhance student learning through the use of its quality assurance systems and ongoing professional development opportunities; 7 Have a minimum of 3–5 Morgan faculty holding membership in the National Academies; 7 Extend Morgan’s position as the leader among HBCUs in the appointment and production of Fulbright Scholars; and 7"
  },
  {
    "page": 27,
    "text": "and promotion activities and programs. These committees will screen all applications for job family promotions and review and make recommendations regarding training and other requirements necessary to advance through a given job family. The following objectives will be pursued. 7 Morgan will launch a professional development program for tenured Associate Professors designed to help expand their academic portfolios (through re- engagement in cutting-edge research and creative activities ) and make them more competitive for promotion to the rank of full professor; 7 By 2030, Morgan will establish a minimum of ten (10) endowed professorships to recruit, attract and retain leading scholars in the nation; 7 Invest in pedagogical development for faculty at all levels focusing on assessment tools and the utilization of new and emerging technologies in the classroom; 7 Annually target a specific percentage of faculty receiving Quality Matters training to promote and improve the quality of online education and enhance student learning through the use of its quality assurance systems and ongoing professional development opportunities; 7 Have a minimum of 3–5 Morgan faculty holding membership in the National Academies; 7 Extend Morgan’s position as the leader among HBCUs in the appointment and production of Fulbright Scholars; and 7 Execute an aggressive faculty recruitment plan to address recommendations emanating from the University’s Blue Ribbon Panel focused on achieving CCIHE R1 status (Goal 3). LEADING THE FUTURE 27 MORGAN.EDU"
  },
  {
    "page": 28,
    "text": "Benchmarking toward this ambitious and multi-faceted goal will be aided by a closer examination of R1 urban serving, aspirational peer institutions including but not limited to: The University of California-Riverside, the University of Central Florida, Wayne State University, Florida International University, SUNY at Albany, the University of Cincinnati–Main Campus and Washington State University.To many, the Carnegie R1 classification is the pinnacle of higher education. Morgan State University embraces its mission to serve “… the community, region, state, nation, and the world as an intellectual and creative resource by supporting, empowering and preparing high-quality, diverse graduates to lead the world.” As the University enters the third decade of the 21st century, designating the attainment of the R1 Carnegie Classification as a goal focuses our efforts on enriching and diversifying the scope and magnitude of our scholarship and creativity. Striving to attain R1 status requires reaching specific indicators shared by institutions who similarly seek or hold this status. The measures of these indicators are addressed in this section of the strategic plan. However, our purpose is more than these metrics. We remain committed to Morgan’s mission as an “intellectual and creative resource.” The details of this strategic goal center on two objectives. Objective 1 focuses on the strategies and metrics for achieving R1 status; while Objective 2 focuses on the strategies enhancing research and program excellence and metrics for measuring our overall success. Primary Goal Statement: Secure the Carnegie Classification for Institutions of Higher Education (CCIHE) designation of R1 “very high research activity institution.” Doctoral Research Universities (DRU) must demonstrate uncommon productivity and output in the areas of research, scholarship and graduate education. There were 261 Institutions of Higher Education included in the CCIHE most recent 2018 list of DRU. These institutions were then equally divided in R1 and R2 classifications. Morgan"
  },
  {
    "page": 28,
    "text": "the University enters the third decade of the 21st century, designating the attainment of the R1 Carnegie Classification as a goal focuses our efforts on enriching and diversifying the scope and magnitude of our scholarship and creativity. Striving to attain R1 status requires reaching specific indicators shared by institutions who similarly seek or hold this status. The measures of these indicators are addressed in this section of the strategic plan. However, our purpose is more than these metrics. We remain committed to Morgan’s mission as an “intellectual and creative resource.” The details of this strategic goal center on two objectives. Objective 1 focuses on the strategies and metrics for achieving R1 status; while Objective 2 focuses on the strategies enhancing research and program excellence and metrics for measuring our overall success. Primary Goal Statement: Secure the Carnegie Classification for Institutions of Higher Education (CCIHE) designation of R1 “very high research activity institution.” Doctoral Research Universities (DRU) must demonstrate uncommon productivity and output in the areas of research, scholarship and graduate education. There were 261 Institutions of Higher Education included in the CCIHE most recent 2018 list of DRU. These institutions were then equally divided in R1 and R2 classifications. Morgan will track these performance indicators on an annual basis, statistically determine its comparative CCIHE classification status, and make data informed decisions and adjustments to foster its ascent toward R1 status. THE PURSUIT OF CARNEGIE R1 ST A TUS The Carnegie Classification® has been the leading framework for recognizing and describing institutional diversity in U.S. higher education for the past four and a half decades. The U.S. News and World Report strictly maps its categories to The Carnegie Classification of Institutions of Higher Education and are used for rankings and grant eligibility. Carnegie listings strongly shape how government officials, independent analysts"
  },
  {
    "page": 28,
    "text": "Objective 1 focuses on the strategies and metrics for achieving R1 status; while Objective 2 focuses on the strategies enhancing research and program excellence and metrics for measuring our overall success. Primary Goal Statement: Secure the Carnegie Classification for Institutions of Higher Education (CCIHE) designation of R1 “very high research activity institution.” Doctoral Research Universities (DRU) must demonstrate uncommon productivity and output in the areas of research, scholarship and graduate education. There were 261 Institutions of Higher Education included in the CCIHE most recent 2018 list of DRU. These institutions were then equally divided in R1 and R2 classifications. Morgan will track these performance indicators on an annual basis, statistically determine its comparative CCIHE classification status, and make data informed decisions and adjustments to foster its ascent toward R1 status. THE PURSUIT OF CARNEGIE R1 ST A TUS The Carnegie Classification® has been the leading framework for recognizing and describing institutional diversity in U.S. higher education for the past four and a half decades. The U.S. News and World Report strictly maps its categories to The Carnegie Classification of Institutions of Higher Education and are used for rankings and grant eligibility. Carnegie listings strongly shape how government officials, independent analysts and academic groups perceive more than 4,600 post-secondary institutions in the United States. To many, the Carnegie R1 classification is the pinnacle of higher education. Elevate Morgan’s Status to R1 Very High Doctoral Research University Goal 3 2030Transformation MORGAN 28"
  },
  {
    "page": 29,
    "text": "Today, African American communities are disproportionately impacted by three (3) intertwined crises: health disparities (e.g., COVID 19 pandemic), sustained multi-generational economic disparities, and persistent police brutality and structural racism. Morgan’s goal to achieve R1 status fully supports and embraces its role as Maryland’s Preeminent Public Urban Research University to more fully address issues that disproportionally impact communities of color. Rising to the R1 classification will enhance Morgan’s stature to serve as the premier Anchor Institution to the City of Baltimore, and beyond. President Wilson has charged Vice President for Research and Economic Development Dr. Willie E. May with assembling a Blue-Ribbon Panel on Research Program Expansion to assist in “identifying a few ‘potential peaks of excellence’ within a number of key technology areas where Morgan could and should develop programs of national prominence.” To date, the University is considering an expanded research agenda and exploring the possibility of establishing peaks of excellence in a limited number of areas such as: Advanced Manufacturing Artificial Intelligence and Machine Learning Biotechnology/ Engineering Biology Brain Science Climate ScienceCommercial Rocketry and Hypersonics Cybersecurity for IOT devices Data AnalyticsQuantum Education/ Literacy Urban Health Equity 7 Achieve annual science and engineering research and development expenditures of $40 million. 7 Achieve annual non- science and engineering research and development expenditures of $8 million. 7 Develop new doctoral programs in each CCIHE category (Humanities, Social Sciences, STEM, Other) sufficient to meet doctoral conferral targets. 7 Increase total annual doctoral conferrals per year to 175 (requires increasing doctoral enrollment with a four to six-year lead). 7 Increase the number of post-doctoral non-faculty research staff to 50. 7 Incrementally increase the number of tenure track faculty to 388. An increase of 60 FTE (18%) above 2018 CCIHE data. 7 Invest and hire in strategic growth clusters. 7 Establish a University Research"
  },
  {
    "page": 29,
    "text": "Blue-Ribbon Panel on Research Program Expansion to assist in “identifying a few ‘potential peaks of excellence’ within a number of key technology areas where Morgan could and should develop programs of national prominence.” To date, the University is considering an expanded research agenda and exploring the possibility of establishing peaks of excellence in a limited number of areas such as: Advanced Manufacturing Artificial Intelligence and Machine Learning Biotechnology/ Engineering Biology Brain Science Climate ScienceCommercial Rocketry and Hypersonics Cybersecurity for IOT devices Data AnalyticsQuantum Education/ Literacy Urban Health Equity 7 Achieve annual science and engineering research and development expenditures of $40 million. 7 Achieve annual non- science and engineering research and development expenditures of $8 million. 7 Develop new doctoral programs in each CCIHE category (Humanities, Social Sciences, STEM, Other) sufficient to meet doctoral conferral targets. 7 Increase total annual doctoral conferrals per year to 175 (requires increasing doctoral enrollment with a four to six-year lead). 7 Increase the number of post-doctoral non-faculty research staff to 50. 7 Incrementally increase the number of tenure track faculty to 388. An increase of 60 FTE (18%) above 2018 CCIHE data. 7 Invest and hire in strategic growth clusters. 7 Establish a University Research Foundation. 7 Increase grant proposal submissions.Accordingly, the following benchmarks have been articulated over a ten-year planning horizon. LEADING THE FUTURE 29 MORGAN.EDU"
  },
  {
    "page": 30,
    "text": "Many of the University’s strategic priorities are predicated on the anticipated increase in student residential enrollment and an infusion of on-line programs tailored to meet the needs of adult and non-traditional learners. As a result, new and pressing demands will be placed on the University’s physical plant and its campus infrastructure. Therefore, Morgan will advance information technology (IT) initiatives as well as new construction, capital improvement, deferred maintenance, athletics facilities and campus safety projects in keeping with the University’s evolving master plan and its changing space allocation needs. NEW CONSTRUCTION 7 Complete new Thurgood Marshall dormitory in 2022. 7 Complete a new Health and Human Services Building by 2024. 7 Complete Phase II of housing plan by 2025. 7 Complete a new Science Complex by 2027. 7 Plan for new engineering building and new multipurpose Convocation Center at Lake Clifton. SPACE ALLOCA TIONS 7 Expand cohort living options for living-learning communities, e.g., Honors, CASA, MILE and EVOLVE. 7 Expand virtual labs on campus and redesign Library and study spaces to embrace innovation and ideation. CAMPUS SAFETY 7 Allocate operational and previously secured external funding for the purchase and installation of school ID, camera and surveillance equipment. 7 Enhance community policing with opening of the new Public Safety Building at Northwood Commons. 7 Recruit and increase campus security personnel.Expand and Improve a Campus-Wide Infrastructure to Support Operational Excellence and Increase Overall Institutional Capacity Goal 4 2030Transformation MORGAN 30"
  },
  {
    "page": 31,
    "text": "INFORMA TION TECHNOLOGY PLAN 7 Maintain an industry-standard, service-based IT environment that facilitates teaching, learning, research and discovery via a research computing support team and infrastructure (new Enterprise Resource Planning). 7 Provide an agile suite of technology services to reliably carry out the daily operations of the University by strengthening IT controls, specifically pertaining to cybersecurity systems. 7 Serve the IT needs of the entire campus community with an exemplary, proactive and service-oriented focus on new and emerging information platforms (TBD). INSTITUTIONAL AD VANCEMENT , FUNDRAISING AND ALUMNI ENGAGEMENT The implementation and execution of this strategic plan are largely dependent upon the University’s ability to optimize its fundraising capacities. This will require expanding the advancement staff with experienced personnel in specific areas of specializations including but not limited to: strategic partnerships, corporate and foundation relations, grants management, major gifts, annual giving, planned giving, and advancement services. Over the next ten years, the Division of Institutional Advancement in partnership with the Division of Rese arch and Economic Development will be tasked with the responsibility to coordinate the work of cross- disciplinary teams of MSU scholars and researchers to secure funding for the establishment of various research centers at Morgan. Such centers would be funded through multi-year grants from state and federal agencies and through private sources. To date, a National Center for the Elimination of Educ ational Disparities and a state-funded Center for Cybersecurity and Crime Reduction have been postulated. Such centers would resemble in form and function the evolving Center for Urban Health Equity at Morgan. In addition to institutional gifts, the Office of Development within the Division of Institutional Advancement will develop solicitation strategies to increase the alumni giving rate. Most importantly, the Division of Institutional Advancement will ensure the development of a feasibility study and campaign plan by"
  },
  {
    "page": 31,
    "text": "upon the University’s ability to optimize its fundraising capacities. This will require expanding the advancement staff with experienced personnel in specific areas of specializations including but not limited to: strategic partnerships, corporate and foundation relations, grants management, major gifts, annual giving, planned giving, and advancement services. Over the next ten years, the Division of Institutional Advancement in partnership with the Division of Rese arch and Economic Development will be tasked with the responsibility to coordinate the work of cross- disciplinary teams of MSU scholars and researchers to secure funding for the establishment of various research centers at Morgan. Such centers would be funded through multi-year grants from state and federal agencies and through private sources. To date, a National Center for the Elimination of Educ ational Disparities and a state-funded Center for Cybersecurity and Crime Reduction have been postulated. Such centers would resemble in form and function the evolving Center for Urban Health Equity at Morgan. In addition to institutional gifts, the Office of Development within the Division of Institutional Advancement will develop solicitation strategies to increase the alumni giving rate. Most importantly, the Division of Institutional Advancement will ensure the development of a feasibility study and campaign plan by the Fall, 2022. Such a plan will anticipate an approved Comprehensive Campaign with an estimated goal in the range of $450M–$500M over ten year s. ALUMNI ENGAGEMENT 7 Increase the percentage of alumni giving to 20% by 2030. 7 Enhance alumni engagement in programs designed and implemented by the Center for Career Development. 7 Create more professional networking, mentoring internship and hiring opportunities for students and alumni, local and abroad. LEADING THE FUTURE 31 MORGAN.EDU"
  },
  {
    "page": 32,
    "text": "Over the next ten years, MSU will deepen and broaden its pivotal role as a recognized anchor institution in the region. This will entail the implementation of a comprehensive approach to community engagement that reinforces the University’s considerable economic and social impact and leverages its symbiotic relationship with local communities. Such a model will facilitate discussions that address key social issues and bring together governmental representatives and citizens to collaboratively generate critical knowledge and practice leading to meaningful policy reform and social change. In this regard, the coming decade will witness the fortification of MSU as a dynamic institutional epicenter for the convergence of scholarship, research and advocacy. In keeping with the University’s distinct mission, each of the units will play a pivotal role in general and applied research that responds to many of the intractable challenges facing our city, such as educational and health inequities, community and neighborhood development, environmental sustainability, and urban violence, to name a few. Below is a partial listing of anticipated efforts. 7 The University will build out its recently established transdisciplinary institute on health equity Center for Urban Health Equity at Morgan, with an ongoing state investment of $3M. This project will be officially inaugurated in 2021. 7 SEUS will train K–12 teachers in the use of Orton-Gillingham methods to enhance levels of literacy among K–12 learners. 7 SEUS will increase levels of teacher competency and assist teachers in gaining National Board Certification, the highest level of teacher certification. 7 With support from an NSF grant, SEUS will enhance the research competence of STEM teachers and faculty so that they are able to build a body of research to inform the practice of STEM teaching to urban learners. 7 SEUS will develop a Principals Equity Pipeline Initiative designed to prepare principals for Baltimore City"
  },
  {
    "page": 32,
    "text": "for the convergence of scholarship, research and advocacy. In keeping with the University’s distinct mission, each of the units will play a pivotal role in general and applied research that responds to many of the intractable challenges facing our city, such as educational and health inequities, community and neighborhood development, environmental sustainability, and urban violence, to name a few. Below is a partial listing of anticipated efforts. 7 The University will build out its recently established transdisciplinary institute on health equity Center for Urban Health Equity at Morgan, with an ongoing state investment of $3M. This project will be officially inaugurated in 2021. 7 SEUS will train K–12 teachers in the use of Orton-Gillingham methods to enhance levels of literacy among K–12 learners. 7 SEUS will increase levels of teacher competency and assist teachers in gaining National Board Certification, the highest level of teacher certification. 7 With support from an NSF grant, SEUS will enhance the research competence of STEM teachers and faculty so that they are able to build a body of research to inform the practice of STEM teaching to urban learners. 7 SEUS will develop a Principals Equity Pipeline Initiative designed to prepare principals for Baltimore City who are equipped to lead schools that are focused on ensuring equity of outcomes for all children. Serve as the Premier Anchor Institution for Baltimore City and Beyond Goal 5 2030Transformation MORGAN 32"
  },
  {
    "page": 33,
    "text": "Of a more immediate nature, Morgan will keep a watchful eye on the anticipated Congressional approval of President Biden’s Build Back Better Agenda and other proposed initiatives. With appropriated governmental and private investments, Morgan can play an exemplary leadership role in developing and implementing replicable educational and entrepreneurial programs that address a widening race-based income gap and mitigate ongoing racial disparities in health care, education and affordable housing. 7 SEUS will explore the feasibility and secure funding for a proposed The National Center for the Elimination of Educational Disparities. This ambitious aspirational initiative will involve multidisciplinary teams of faculty who will engage in outreach to parents, communities and schools in a multi-pronged approach to providing K-12 students with all of the supports that they need to attain the highest levels of achievement regardless of their socioeconomic status. 7 The School of Social Work will partner with the Morgan Community Mile to develop a comprehensive community needs assessment that will be shared broadly across all academic units, leading to their input and active participation. 7 The University will develop a Center for Ideation and Innovation that will provide creative space for University faculty, staff, alumni, and students to collaborate with community residents to develop effective interventions and solutions to complex problems ranging from unemployment in the Black community to opportunities for entrepreneurship, wealth creation and technology transfer. 7 Expand mandatory internships for undergraduate and graduate students placed in non-profit agencies and organizations from 150 to over 300 in collaboration with Morgan’s Second Year Experience Program. 7 Broaden the University’s public and community engagement infrastructure through the facilitation of interdisciplinary and transdisciplinary applied research. Elevate the University’s menu of online programs that support Black and indigenous people of color (BIPOC). 7 The School of Global Journalism, in partnership with the Schools of"
  },
  {
    "page": 33,
    "text": "will engage in outreach to parents, communities and schools in a multi-pronged approach to providing K-12 students with all of the supports that they need to attain the highest levels of achievement regardless of their socioeconomic status. 7 The School of Social Work will partner with the Morgan Community Mile to develop a comprehensive community needs assessment that will be shared broadly across all academic units, leading to their input and active participation. 7 The University will develop a Center for Ideation and Innovation that will provide creative space for University faculty, staff, alumni, and students to collaborate with community residents to develop effective interventions and solutions to complex problems ranging from unemployment in the Black community to opportunities for entrepreneurship, wealth creation and technology transfer. 7 Expand mandatory internships for undergraduate and graduate students placed in non-profit agencies and organizations from 150 to over 300 in collaboration with Morgan’s Second Year Experience Program. 7 Broaden the University’s public and community engagement infrastructure through the facilitation of interdisciplinary and transdisciplinary applied research. Elevate the University’s menu of online programs that support Black and indigenous people of color (BIPOC). 7 The School of Global Journalism, in partnership with the Schools of Architecture and Planning, Liberal Arts and Social Work will begin to host at least five (open to the public) discourses a year focusing on public policy and matters of direct interest to neighboring communities (Fall, 2022). 7 The School of Business will seek substantial funding from the Maryland E-Nnovation Initiative (and other sources) to support entrepreneurial activities and the recruitment of expert faculty. LEADING THE FUTURE 33 MORGAN.EDU"
  },
  {
    "page": 34,
    "text": "The University’s Division of International Affairs has articulated a bold vision to bring to fruition MORGAN GLOBAL over the next ten years. This ambitious initiative will unfold over the next ten years and will expand the University’s international footprint by enabling it to open and operate “satellite campuses” in key locations around the world. These international satellite campuses will serve two purposes: 1)T o expand Morgan’s brand recognition around the world in order to recruit and enroll more international students (in Baltimore and overseas) and 2) support our domestic students t o become truly global citizens by allowing them to study abroad (short and long term) using these international campuses. These mutually reinforcing goals will be achieved through the following means. MORGAN GLOBAL GOALS Accelerate Global Education Initiatives and Expand the University’s International Footprint Goal 6 800 to 1,000Enroll who will attend Morgan Global face to face (Baltimore and satellite campuses overseas) and online (Morgan Online). (Current enrollment is 400 international students in Baltimore.)international studentsTET Fund InitiativeBuild upon the ongoing in Nigeria and develop a replicable model for forging similar partnerships in Ghana and other African nations (Fall 2022). West Africa- Ghana MBAOffer a and other master’s degree programs once local accreditation is approved (Fall 2022). 2030Transformation MORGAN 34"
  },
  {
    "page": 35,
    "text": "INTERNA TIONAL EDUCA TION GOALS (MAIN CAMPUS) Morgan alumni chapters outside of the United StatesLaunch including the first international chapter, Morgan State University Kenya Alumni chapter, that will help forge strategic partnerships in Kenya and recruit more international students from Kenya.Kenyatta University & local NGOsForge a partnership with to develop joint projects in STEM areas.connect West & East African universitiesLaunch cube satellites that in Fall 2022 or Spring 2023, and in other places in Latin America and the Caribbean, as appropriate.Engineering/ STEM partnershipsHire a Director for in Africa (part time).Develop a program effectiveness survey to evaluate all administered and third-party programs. Create an annual evaluation instrument to be utilized beginning in Fall 2022.Increase international student diversity and quality. Double the number of international students from 400 to 800 in ten years.Prepare Morgan students to be competitive for the Rhodes, Marshall and Newman scholarships and other prestigious prizes over the next ten years.Work to provide 10% of Morgan students with an international experience by 2030At the same time, the University remains committed to cultivating a campus culture that celebrates, supports and promotes internationalization, global learning and intercultural competencies among students, faculty and staff. LEADING THE FUTURE 35 MORGAN.EDU"
  },
  {
    "page": 36,
    "text": "THE ROAD AHEADEnterprise Planning at Morgan State University: 2030Transformation MORGAN 36"
  },
  {
    "page": 37,
    "text": "We must transform our institutions so that the entire enterprise operates from a growth mind-set (Dweck, 2006), where mistakes and missteps are seen as excellent opportunities to develop our individual and collective brain. – Cia Verschelden“ ” LEADING THE FUTURE 37 MORGAN.EDU"
  },
  {
    "page": 38,
    "text": "Our Transformation Morgan 2030 Strategic Plan represents an important step forward in the organizational life cycle of this institution. This plan is the product of intense internal discussion and institutional self-assessment. However, its implementation is inextricably interwoven with and dependent upon close collaboration with external entities in the private sector and in governmental agencies at the municipal, state and federal levels. Clearly, Morgan State University is compelled to do more “active listening” if it is to expand its role as a recognized anchor institution in the region. Therefore, in the years ahead, the University’s Division of Institutional Advancement and its Office of Governmental Relations will take full advantage of symbiotic relationships and forge synergistic partnerships with a broad spectrum of organizations with similar strategic objectives and goals. In fact, it is difficult to imagine the actualization of many of our strategic goals without the involvement of “outside entities” that understand and appreciate our distinctive educational mission and view themselves as viable partners in most of our undertakings. Also, this plan signals a deeper appreciation and application of principles of enterprise planning in higher education. In brief, Morgan State University is intentionally abandoning tendencies toward “silo- ing” and the unwitting and unfortunate Balkanization of various academic units and departments. Such silos tend to operate independently and avoid sharing constructive and problem-solving information and insights. In the past, such proclivities have reduced our overall efficiency and undermined the culture of continuous improvement that we want to cultivate and maintain here at Morgan. Looking ahead, we are determined to employ an enterprise-approach to organizational change whereby all units embrace a shared responsibility for our institutional health and vitality. Similar to our counterparts in business, we intend to take into consideration data-driven trends and analyses. In addition, we will no longer focus on one"
  },
  {
    "page": 38,
    "text": "Office of Governmental Relations will take full advantage of symbiotic relationships and forge synergistic partnerships with a broad spectrum of organizations with similar strategic objectives and goals. In fact, it is difficult to imagine the actualization of many of our strategic goals without the involvement of “outside entities” that understand and appreciate our distinctive educational mission and view themselves as viable partners in most of our undertakings. Also, this plan signals a deeper appreciation and application of principles of enterprise planning in higher education. In brief, Morgan State University is intentionally abandoning tendencies toward “silo- ing” and the unwitting and unfortunate Balkanization of various academic units and departments. Such silos tend to operate independently and avoid sharing constructive and problem-solving information and insights. In the past, such proclivities have reduced our overall efficiency and undermined the culture of continuous improvement that we want to cultivate and maintain here at Morgan. Looking ahead, we are determined to employ an enterprise-approach to organizational change whereby all units embrace a shared responsibility for our institutional health and vitality. Similar to our counterparts in business, we intend to take into consideration data-driven trends and analyses. In addition, we will no longer focus on one or a singular subset of performance outcomes to the exclusion of others. Instead, we will utilize operational processes that (in our case) encompass a thoughtful integration of marketing and student recruitment functions, a systematic and regular assessment of our current and proposed educational programs and co-curricular offerings and exemplary customer service. At Morgan, we intend to adhere to what the public sector refers to as a “whole of government approach” to problem solving and constructive change. This critically important organizational characteristic will mark the road ahead and lead to the fulfillment of our highest aspirations. O 2030Transformation MORGAN 38"
  },
  {
    "page": 39,
    "text": "LEADING THE FUTURE39 MORGAN.EDU"
  },
  {
    "page": 40,
    "text": "Ahead … RoadThe …Then the hand seeks other hands to help, A community of hands to help– Thus the dream becomes not one man’s dream alone, But a community dream. Not my dream alone, but our dream. Not my world alone, But your world and my world, Belonging to all the hands who build. – Langston Hughes “ ” Morgan State University | 1700 East Cold Spring Lane | Baltimore, Maryland 21251 morgan.eduThe Honorable Kweisi Mfume, Chairman U.S. Congressman, 7th District of Maryland Gen. Larry R. Ellis, Vice Chair U.S. Army (Ret.) Tracey L. Parker-Warren, Secretary Administrative Law Judge, Maryland Office of Administrative Hearings McCall Brown Student Regent Harold Carter Jr. Pastor, New Shiloh Baptist Church Linda J. Gilliam, D.M.D. Former Chairperson of the Board of Directors, Gilliam FoundationBurney J. Hollis, Ph.D. Retired Professor of English and Dean Emeritus of the College of Liberal Arts, Morgan State University Emily M. Hunter Principal, Arlington Elementary School, Baltimore City Public Schools Owner, Nothing Bundt Cakes, Owings Mills, Maryland Shirley M. Malcom, Ph.D. Head, The Directorate for Education and Human Resources Programs, American Association for the Advancement of Science Wayne Resnick President and CEO, Martin’s CaterersWilliam A. Sherman, II, Esq. Equity Partner, Dinsmore & Shohl LLP Shelonda D. Stokes President, Downtown Partnership of Baltimore Carl W. Turnipseed Retired Executive Vice President, Federal Reserve Bank of New York Marquis Walker, Ph.D. Post-doctoral Fellow, The Johns Hopkins University School of Medicine Winston A. Wilkinson Chief of Staff, Maryland Governor’s Office of Community Initiatives Hongtao Yu, Ph.D. Provost and Senior Vice President, Academic Affairs Sidney H. Evans Jr. Executive Vice President, Finance and Administration Don-Terry Veal, Ph.D. Vice President, State and Federal Relations and Chief of Staff Kevin Banks, Ed.D. Vice President, Student AffairsDonna J. Howard Vice President, Institutional Advancement Willie E. May, Ph.D. Vice President,"
  },
  {
    "page": 40,
    "text": "Office of Administrative Hearings McCall Brown Student Regent Harold Carter Jr. Pastor, New Shiloh Baptist Church Linda J. Gilliam, D.M.D. Former Chairperson of the Board of Directors, Gilliam FoundationBurney J. Hollis, Ph.D. Retired Professor of English and Dean Emeritus of the College of Liberal Arts, Morgan State University Emily M. Hunter Principal, Arlington Elementary School, Baltimore City Public Schools Owner, Nothing Bundt Cakes, Owings Mills, Maryland Shirley M. Malcom, Ph.D. Head, The Directorate for Education and Human Resources Programs, American Association for the Advancement of Science Wayne Resnick President and CEO, Martin’s CaterersWilliam A. Sherman, II, Esq. Equity Partner, Dinsmore & Shohl LLP Shelonda D. Stokes President, Downtown Partnership of Baltimore Carl W. Turnipseed Retired Executive Vice President, Federal Reserve Bank of New York Marquis Walker, Ph.D. Post-doctoral Fellow, The Johns Hopkins University School of Medicine Winston A. Wilkinson Chief of Staff, Maryland Governor’s Office of Community Initiatives Hongtao Yu, Ph.D. Provost and Senior Vice President, Academic Affairs Sidney H. Evans Jr. Executive Vice President, Finance and Administration Don-Terry Veal, Ph.D. Vice President, State and Federal Relations and Chief of Staff Kevin Banks, Ed.D. Vice President, Student AffairsDonna J. Howard Vice President, Institutional Advancement Willie E. May, Ph.D. Vice President, Research and Economic Development Adebisi Oladipupo, D.Sc. Vice President/Chief Information Officer, Division of Information Technology Kara M. Turner, Ph.D. Vice President, Enrollment Management and Student SuccessErlease M. Wagner Interim Vice President and Athletic Director Armanda Grant Special Assistant to the President Julie Goodwin General Counsel Abraham Mauer Director, Internal Audit and Management ReviewMorgan State University Board of Regents President’s Administrative Team"
  }
]